ams/src/Reports/AMS_ДоговорыСКлиентами/AMS_ДоговорыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>AMS_ДоговорыСКлиентами</name>
</mdclass:Report>

ams/src/InformationRegisters/AMS_ДанныеДоговоров/AMS_ДанныеДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_ДанныеДоговоров</name>
  <resources>
    <name>СторонаОформления</name>
    <comment>0 - партнер, 1 - наша организация</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СогласованРуководитель</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласованГлавбух</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласованЮрист</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласованДиректор</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОтправки</name>
    <comment>Почтой, курьеров, поставкой, доставкой</comment>
    <type>
      <types>EnumRef._СпособыОтправкиДоговора</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияСкана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияОригинала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокУведомленияОбИзменениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/_ПриложенияКДоговорам/_ПриложенияКДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ПриложенияКДоговорам</name>
  <resources>
    <name>ДатаПолученияСкана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияОригинала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПриложения</name>
    <type>
      <types>EnumRef._ВидыПриложенийКДоговорам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Enums/AMS_Права/AMS_Права.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_Права</name>
  <enumValues>
    <name>СозданиеДоговораПоставки</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпецификацийВДокументеПроизводствоЗаСмену</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеРеализацииБезОграничений</name>
  </enumValues>
  <enumValues>
    <name>Продукция_ПроизводствоПередача</name>
    <comment>Полный доступ к документу &quot;Производство за смену&quot;</comment>
  </enumValues>
  <enumValues>
    <name>Продукция_ПередачаНаСклад</name>
    <comment>Документ &quot;Производство за смену&quot;: ввод произведенного и передеча на склад</comment>
  </enumValues>
  <enumValues>
    <name>РазрешитьИзменятьЦены</name>
  </enumValues>
  <enumValues>
    <name>Устанавливать_MIN_MAX_Запасы</name>
  </enumValues>
  <enumValues>
    <name>УтверждатьПланПроизводства</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговораЗаРуководителя</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>_АртикулКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_АртикулКлиентаПлюс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзАктОРасхождениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзСпецификация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзСЧ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзТТН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзТОРГ12</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзУПД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_Стикерование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_ПорядокКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ТранпортнаяУслуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>_ТранпортнаяУслугаСпособ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ТранпортнаяУслугаПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ТранпортнаяУслугаСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ШтрихКодЕдиницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_ШтрихКодУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMS_СегментРынка</name>
    <type>
      <types>CatalogRef.AMS_СегментыРынка</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Reports/AMS_ДоговорыСКлиентами/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьЗаголовокПериода();
	НастройкаФормы();
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьТекущиеДелаЭДО" Тогда
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаДоступаПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	НастройкаФормы();
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПолученияСканаПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПолученияОригиналаПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура НетПродажПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЗакрытыеДоговорыПриИзменении(Элемент)
	Если СкрытьЗакрытыеДоговоры Тогда
		Статус = Неопределено;
	КонецЕсли;

	НастройкаФормы();
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;

	Поле = ПолучитьДанныеПоля(Расшифровка);

	ПоказатьЗначение(Неопределено, Поле.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ВидПриложенияПриИзменении(Элемент)
	ПоказатьПриложенияКДоговорам();
КонецПроцедуры

&НаКлиенте
Процедура НетСканаПриложенияПриИзменении(Элемент)
	ПоказатьПриложенияКДоговорам();
КонецПроцедуры

&НаКлиенте
Процедура НетОригиналаПриложенияПриИзменении(Элемент)
	ПоказатьПриложенияКДоговорам();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабл

&НаКлиенте
Процедура ТаблПриАктивизацииСтроки(Элемент)
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		Договор = Элемент.ТекущиеДанные.Договор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Имя = Поле.Имя;

	Если Имя = "ТаблСтатус" И Элемент.ТекущиеДанные.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
		"Перечисление.СтатусыДоговоровКонтрагентов.Действует") Тогда

		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект), "Закрыть договор?",
			РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

	ИначеЕсли Имя = "ТаблПлюс" Тогда
		ОткрытьФорму("Отчет.AMS_ДоговорыСКлиентами.Форма.ФормаПриложений", Новый Структура("Договор", Договор), , , , ,
			Новый ОписаниеОповещения("ОткрытьФормуПриложенийЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ИначеЕсли Имя = "ТаблСтатус" 
		Или	Имя = "ТаблСогласованРуководитель" Или Имя = "ТаблСогласованЮрист"
		Или Имя = "ТаблСогласованГлавбух" Или Имя = "ТаблСогласованДиректор" Тогда
		Возврат;
		
	Иначе
		ПоказатьЗначение( , Договор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтатус = ТекущийЭлемент.ТекущиеДанные.Статус;

	Элемент.СписокВыбора.Очистить();

	НеСогласован = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
		"Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован");
	Действует    = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.Действует");

	Если Не ЗначениеЗаполнено(ТекСтатус) Или ТекСтатус = НеСогласован Тогда
		Элементы.ТаблСтатус.СписокВыбора.Добавить(НеСогласован);
		Элементы.ТаблСтатус.СписокВыбора.Добавить(Действует);

	ИначеЕсли ТекСтатус = Действует Тогда
		Элементы.ТаблСтатус.СписокВыбора.Добавить(Действует);
		Элементы.ТаблСтатус.СписокВыбора.Добавить(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Перечисление.СтатусыДоговоровКонтрагентов.Закрыт"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСтатусПриИзменении(Элемент)
	ТекСтатус = ТекущийЭлемент.ТекущиеДанные.Статус;

	Если ЗначениеЗаполнено(ТекСтатус) И ПравоИзмененияДоговора() Тогда
		ИзменитьДоговор(Договор, "Статус", ТекСтатус);
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСторонаОформленияПриИзменении(Элемент)
	Если ПравоИзмененияДоговора() Тогда
		ИзменитьДопДанныеДоговора(Договор, "СторонаОформления", ТекущийЭлемент.ТекущиеДанные.СторонаОформления);
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаНачалаДействияПриИзменении(Элемент)
	Если ПравоИзмененияДоговора() Тогда
		ИзменитьДоговор(Договор, "ДатаНачалаДействия", ТекущийЭлемент.ТекущиеДанные.ДатаНачалаДействия);
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаОкончанияДействияПриИзменении(Элемент)
	Если ПравоИзмененияДоговора() Тогда
		ИзменитьДоговор(Договор, "ДатаОкончанияДействия", ТекущийЭлемент.ТекущиеДанные.ДатаОкончанияДействия);
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСогласованРуководительПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор, "СогласованРуководитель", ТекущийЭлемент.ТекущиеДанные.СогласованРуководитель);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСогласованЮристПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор, "СогласованЮрист", ТекущийЭлемент.ТекущиеДанные.СогласованЮрист);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСогласованГлавбухПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор, "СогласованГлавбух", ТекущийЭлемент.ТекущиеДанные.СогласованГлавбух);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСогласованДиректорПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор, "СогласованДиректор", ТекущийЭлемент.ТекущиеДанные.СогласованДиректор);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСпособОтправкиПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор, "СпособОтправки", ТекущийЭлемент.ТекущиеДанные.СпособОтправки);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаОтправкиПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор, "ДатаОтправки", ТекущийЭлемент.ТекущиеДанные.ДатаОтправки);
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаПолученияСканаПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор, "ДатаПолученияСкана", ТекущийЭлемент.ТекущиеДанные.ДатаПолученияСкана);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаПолученияОригиналаПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор, "ДатаПолученияОригинала", ТекущийЭлемент.ТекущиеДанные.ДатаПолученияОригинала);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСрокУведомленияОбИзмененияхПриИзменении(Элемент)
	Срок = ТекущийЭлемент.ТекущиеДанные.СрокУведомленияОбИзменениях;
	Если Не Срок = 14 Тогда
		ИзменитьДопДанныеДоговора(Договор, "СрокУведомленияОбИзменениях", Срок);
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура Документы(Команда)
	ПараметрКоманды	= Новый Структура("Договор", Элементы.Табл.ТекущиеДанные.Договор);
	ОткрытьФорму("ОбщаяФорма.ДокументыПоДоговору", ПараметрКоманды, ЭтотОбъект, КлючУникальности);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", ДатаНачала, ДатаОкончания, Истина);

	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, , , , , ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	Элементы.Статус.СписокВыбора.Очистить();
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.НеСогласован);
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	Если Не СкрытьЗакрытыеДоговоры Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.Закрыт);
	КонецЕсли;

	Если Не AMS_ВызовСервера.ЭтоKhors() Тогда
		ЭтоЮрист           = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_Юрист");
		ЭтоСтаршийМенеджер = Пользователи.РолиДоступны("_СтаршийМенеджер,_СтаршийМенеджерМЕГА");
		ЭтоГлавБухгалтер   = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_ГлавныйБухгалтер");
		ЭтоДиректор        = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_Директор");
		ЭтоСекретарь       = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_Секретарь");

		СогласованиеДоговораЗаРуководителя = AMS_ВызовСервера.ЕстьПравоАМС(Перечисления.AMS_Права.СогласованиеДоговораЗаРуководителя);

		Элементы.ТаблСтатус.ТолькоПросмотр                      = Не ЭтоЮрист;
		Элементы.ТаблСторонаОформления.ТолькоПросмотр           = Не (ЭтоЮрист Или ЭтоСтаршийМенеджер);
		Элементы.ТаблДатаНачалаДействия.ТолькоПросмотр          = Не (ЭтоЮрист Или ЭтоСтаршийМенеджер);
		Элементы.ТаблДатаОкончанияДействия.ТолькоПросмотр       = Не (ЭтоЮрист Или ЭтоСтаршийМенеджер);
		Элементы.ТаблСогласованРуководитель.ТолькоПросмотр      = Не (ЭтоСтаршийМенеджер Или СогласованиеДоговораЗаРуководителя);
		Элементы.ТаблСогласованЮрист.ТолькоПросмотр             = Не ЭтоЮрист;
		Элементы.ТаблСогласованГлавбух.ТолькоПросмотр           = Не ЭтоГлавБухгалтер;
		Элементы.ТаблСогласованДиректор.ТолькоПросмотр          = Не (ЭтоГлавБухгалтер Или ЭтоДиректор);
		Элементы.ТаблСпособОтправки.ТолькоПросмотр              = Не ЭтоСекретарь;
		Элементы.ТаблДатаОтправки.ТолькоПросмотр                = Не ЭтоСекретарь;
		Элементы.ТаблДатаПолученияСкана.ТолькоПросмотр          = Не ЭтоЮрист;
		Элементы.ТаблДатаПолученияОригинала.ТолькоПросмотр      = Не (ЭтоСекретарь Или ЭтоЮрист);
		Элементы.ТаблСрокУведомленияОбИзменениях.ТолькоПросмотр = Не (ЭтоЮрист Или ЭтоСтаршийМенеджер);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Табл.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.ДатаПолученияОригинала");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.КоличествоПродаж");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПолностьюОбеспечен);
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Табл.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Табл.ДатаПолученияОригинала");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Табл.ДатаПолученияСкана");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.КоличествоПродаж");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаВнимание);
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Табл.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.СтатусыДоговоровКонтрагентов.Закрыт");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);

	// Статус НЕ СОГЛАСОВАН

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСтатус.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.СогласованДиректор");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = '00010101';

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованЮрист.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.СогласованРуководитель");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = '00010101';

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	
	// Статус ДЕЙСТВУЕТ

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаНачалаДействия.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаОкончанияДействия.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованРуководитель.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованЮрист.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованГлавбух.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованДиректор.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСрокУведомленияОбИзменениях.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.СтатусыДоговоровКонтрагентов.Действует");

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Статус ЗАКРЫТ

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСтатус.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСторонаОформления.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаНачалаДействия.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаОкончанияДействия.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованРуководитель.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованЮрист.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованГлавбух.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованДиректор.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСпособОтправки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаОтправки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаПолученияСкана.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаПолученияОригинала.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСрокУведомленияОбИзменениях.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Перечисление.СтатусыДоговоровКонтрагентов.Закрыт");

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДатаОкончания = РезультатВыбора.КонецПериода;

	УстановитьЗаголовокПериода();

	ПоказатьИсполнениеДоговоров();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокПериода()
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецМесяца(НачалоМесяца(ТекущаяДатаСеанса()) - 600);
	КонецЕсли;

	ДатаНачала = НачалоМесяца(ДобавитьМесяц(ДатаОкончания, -12));
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчет()
	ПоказатьОтчетНаСервере();

	ИдентификаторСтроки = 0;
	Для Каждого Стр Из Табл Цикл
		Если Стр.Договор = Договор Тогда
			ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Элементы.Табл.ТекущаяСтрока = ИдентификаторСтроки;

	ПоказатьИсполнениеДоговоров();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоля(Расшифровка)
	ДанныеРасшифровкиКД = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);

	Поля = ДанныеРасшифровкиКД.Элементы[Расшифровка].ПолучитьПоля();

	Возврат Новый Структура("Поле,Значение", Поля[0].Поле, Поля[0].Значение);
КонецФункции

&НаСервере
Процедура ПоказатьИсполнениеДоговоров()
	Результат.Очистить();

	СКД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("скдИсполнение");

	Парам = Новый Структура;
	Парам.Вставить("Договора", Табл.Выгрузить( , "Договор").ВыгрузитьКолонку("Договор"));
	Парам.Вставить("ДатаОкончания", ДатаОкончания);
	Парам.Вставить("СкладПродукции", AMS_ВызовСервера.СкладПродукции());

	Расшифровка = Новый ДанныеРасшифровкиКомпоновкиДанных;

	Данные = Новый Структура;
	Данные.Вставить("СКД", СКД);
	Данные.Вставить("Результат", Результат);
	Данные.Вставить("Параметры", Парам);
	Данные.Вставить("Расшифровка", Расшифровка);

	AMS_ВызовСервера.ВыполнитьСКД(Данные);

	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(Данные.Расшифровка, УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтчетНаСервере()
	СписокСтатус = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Статус) Тогда
		СписокСтатус.Добавить(Статус);
	Иначе
		СписокСтатус.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.НеСогласован);
		СписокСтатус.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.Действует);
		Если Не СкрытьЗакрытыеДоговоры Тогда
			СписокСтатус.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.Закрыт);
		КонецЕсли;
	КонецЕсли;

	ТипыДокументов = Новый СписокЗначений;
	ТипыДокументов.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию(
		"Акт выполненных работ для клиента (Документ)", Истина));
	ТипыДокументов.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию(
		"Передача товаров (Документ)", Истина));
	ТипыДокументов.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию(
		"Реализация товаров и услуг (Документ)", Истина));

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("СписокСтатус", СписокСтатус);
	Запрос.УстановитьПараметр("ТипыДокументов", ТипыДокументов);

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	д.Организация КАК Организация,
	|	д.Партнер КАК Партнер,
	|	п.ГруппаДоступа КАК ГруппаДоступа,
	|	д.Контрагент КАК Контрагент,
	|	д.Ссылка КАК Договор,
	|	д.Статус КАК Статус,
	|	д.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	д.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	дд.СогласованРуководитель КАК СогласованРуководитель,
	|	дд.СогласованЮрист КАК СогласованЮрист,
	|	дд.СогласованГлавбух КАК СогласованГлавбух,
	|	дд.СогласованДиректор КАК СогласованДиректор,
	|	дд.ДатаОтправки КАК ДатаОтправки,
	|	дд.СпособОтправки КАК СпособОтправки,
	|	дд.ДатаПолученияСкана КАК ДатаПолученияСкана,
	|	дд.ДатаПолученияОригинала КАК ДатаПолученияОригинала,
	|	дд.СторонаОформления КАК СторонаОформления,
	|	ВЫБОР
	|		КОГДА дд.СрокУведомленияОбИзменениях ЕСТЬ NULL
	|		ИЛИ дд.СрокУведомленияОбИзменениях = 0
	|			ТОГДА 14
	|		ИНАЧЕ дд.СрокУведомленияОбИзменениях
	|	КОНЕЦ КАК СрокУведомленияОбИзменениях,
	|	п.БизнесРегион КАК БизнесРегион,
	|	д.Менеджер КАК Менеджер,
	|	ВЫБОР
	|		КОГДА п.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА д.Партнер.Наименование
	|		ИНАЧЕ п.Родитель.Наименование
	|	КОНЕЦ КАК РодительНаименование,
	|	д.Партнер.Наименование КАК ПартнерНаименование,
	|	д.Контрагент.Наименование КАК КонтрагентНаименование,
	|	д.Наименование КАК ДоговорНаименование
	|ПОМЕСТИТЬ дог
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AMS_ДанныеДоговоров КАК дд
	|		ПО д.Ссылка = дд.Договор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК п
	|		ПО д.Партнер = п.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И (д.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|	ИЛИ д.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером))
	|	И д.Статус В (&СписокСтатус)";

	Если ЗначениеЗаполнено(ГруппаДоступа) Тогда
		Запрос.УстановитьПараметр("ГруппаДоступа", ГруппаДоступа);

		ТекстЗапроса = ТекстЗапроса + "
		|	И п.ГруппаДоступа = &ГруппаДоступа";
	КонецЕсли;

	Если ЗначениеЗаполнено(Менеджер) Тогда
		Запрос.УстановитьПараметр("Менеджер", Менеджер);

		ТекстЗапроса = ТекстЗапроса + "
		|	И д.Менеджер = &Менеджер";
	КонецЕсли;

	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос.УстановитьПараметр("Партнер", Клиент);

		ТекстЗапроса = ТекстЗапроса + "
		|	И д.Партнер = &Партнер";
	КонецЕсли;

	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", Контрагент);

		ТекстЗапроса = ТекстЗапроса + "
		|	И д.Контрагент = &Контрагент";
	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);

		ТекстЗапроса = ТекстЗапроса + "
		|	И д.Организация = &Организация";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Согл.Ссылка КАК Соглашение,
	|	Согл.СегментПартнеров КАК Сегмент
	|ПОМЕСТИТЬ Согл
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК Согл
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГрафикиОплаты.Этапы КАК Этап
	|		ПО Согл.ГрафикОплаты = Этап.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК Цены
	|		ПО Согл.Ссылка = Цены.Ссылка
	|ГДЕ
	|	Согл.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|	И НЕ Согл.ЦенаВключаетНДС
	|	И Согл.Типовое
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сегмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Партнер КАК Партнер,
	|	МАКСИМУМ(т.Сегмент) КАК Сегмент
	|ПОМЕСТИТЬ Сегм
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК т
	|ГДЕ
	|	т.Сегмент В
	|		(ВЫБРАТЬ
	|			т.Сегмент КАК Сегмент
	|		ИЗ
	|			Согл КАК т)
	|СГРУППИРОВАТЬ ПО
	|	т.Партнер
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ т.Сегмент) = 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сегмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сегм.Партнер КАК Партнер,
	|	Согл.Соглашение КАК Соглашение
	|ПОМЕСТИТЬ СоглТип
	|ИЗ
	|	Сегм КАК Сегм
	|		ЛЕВОЕ СОЕДИНЕНИЕ Согл КАК Согл
	|		ПО Сегм.Сегмент = Согл.Сегмент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(д.Ссылка) КАК Соглашение,
	|	д.Организация КАК Организация,
	|	д.Партнер КАК Партнер,
	|	д.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СоглИнд
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК д
	|ГДЕ
	|	НЕ д.Типовое
	|	И д.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|СГРУППИРОВАТЬ ПО
	|	д.Организация,
	|	д.Партнер,
	|	д.Контрагент
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ д.Ссылка) = 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	дог.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА СоглИнд.Соглашение ЕСТЬ NULL
	|			ТОГДА СоглТип.Соглашение
	|		ИНАЧЕ СоглИнд.Соглашение
	|	КОНЕЦ КАК Соглашение
	|ПОМЕСТИТЬ Соглашения
	|ИЗ
	|	дог КАК дог
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоглИнд КАК СоглИнд
	|		ПО дог.Организация = СоглИнд.Организация
	|		И дог.Партнер = СоглИнд.Партнер
	|		И дог.Контрагент = СоглИнд.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоглТип КАК СоглТип
	|		ПО дог.Партнер = СоглТип.Партнер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Договор КАК Договор,
	|	МАКСИМУМ(т.ДатаПервичногоДокумента) КАК ПоследняяОперация,
	|	СУММА(1) КАК КоличествоПродаж
	|ПОМЕСТИТЬ док
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК т
	|ГДЕ
	|	т.Договор В (ВЫБРАТЬ т.Договор КАК Договор ИЗ дог КАК т)
	|	И т.ТипСсылки В(&ТипыДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Договор КАК Договор,
	|	КОЛИЧЕСТВО(т.ВидПриложения) КАК Плюс
	|ПОМЕСТИТЬ Прилож
	|ИЗ
	|	РегистрСведений._ПриложенияКДоговорам КАК т
	|СГРУППИРОВАТЬ ПО
	|	т.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Соглашения.Договор КАК Договор,
	|	Соглашения.Соглашение КАК Соглашение,
	|	МАКСИМУМ(СпрСогл.ВидЦен) КАК ВидЦенБХ,
	|	МАКСИМУМ(ЦенГруппы.ВидЦен) КАК ВидЦенМЕГА,
	|	МАКСИМУМ(Графики.Сдвиг) КАК Отсрочка
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Соглашения КАК Соглашения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СпрСогл
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК ЦенГруппы
	|			ПО СпрСогл.Ссылка = ЦенГруппы.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГрафикиОплаты.Этапы КАК Графики
	|			ПО СпрСогл.ГрафикОплаты = Графики.Ссылка
	|		ПО Соглашения.Соглашение = СпрСогл.Ссылка
	|ГДЕ
	|	Соглашения.Соглашение <> НЕОПРЕДЕЛЕНО
	|СГРУППИРОВАТЬ ПО
	|	Соглашения.Договор,
	|	Соглашения.Соглашение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	дог.БизнесРегион КАК БизнесРегион,
	|	вт.ВидЦенБХ КАК ВидЦенБХ,
	|	вт.ВидЦенМЕГА КАК ВидЦенМЕГА,
	|	дог.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	дог.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	дог.ДатаОтправки КАК ДатаОтправки,
	|	дог.ДатаПолученияОригинала КАК ДатаПолученияОригинала,
	|	дог.ДатаПолученияСкана КАК ДатаПолученияСкана,
	|	дог.Договор КАК Договор,
	|	ЕСТЬNULL(док.КоличествоПродаж, 0) КАК КоличествоПродаж,
	|	дог.Контрагент КАК Контрагент,
	|	дог.Менеджер КАК Менеджер,
	|	вт.Отсрочка КАК Отсрочка,
	|	дог.Партнер КАК Партнер,
	|	Прилож.Плюс КАК Плюс,
	|	док.ПоследняяОперация КАК ПоследняяОперация,
	|	дог.СогласованГлавбух КАК СогласованГлавбух,
	|	дог.СогласованДиректор КАК СогласованДиректор,
	|	дог.СогласованРуководитель КАК СогласованРуководитель,
	|	дог.СогласованЮрист КАК СогласованЮрист,
	|	вт.Соглашение КАК Соглашение,
	|	дог.СпособОтправки КАК СпособОтправки,
	|	дог.СрокУведомленияОбИзменениях КАК СрокУведомленияОбИзменениях,
	|	дог.Статус КАК Статус,
	|	дог.СторонаОформления КАК СторонаОформления,
	|	дог.Организация КАК Организация,
	|	дог.ГруппаДоступа КАК ГруппаДоступа,
	|	дог.РодительНаименование КАК РодительНаименование,
	|	дог.ПартнерНаименование КАК ПартнерНаименование,
	|	дог.КонтрагентНаименование КАК КонтрагентНаименование,
	|	дог.ДоговорНаименование КАК ДоговорНаименование
	|ИЗ
	|	дог КАК дог
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО дог.Договор = вт.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ док КАК док
	|		ПО дог.Договор = док.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Прилож КАК Прилож
	|		ПО дог.Договор = Прилож.Договор";

	Отбор = "";
	Если НетСкана Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "дог.ДатаПолученияСкана = ДАТАВРЕМЯ(1,1,1) И дог.ДатаПолученияОригинала = ДАТАВРЕМЯ(1,1,1)";
	КонецЕсли;
	
	Если НетОригинала Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "дог.ДатаПолученияОригинала = ДАТАВРЕМЯ(1,1,1)";
	КонецЕсли;
	
	Если Продажи = 1 Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "ЕСТЬNULL(док.КоличествоПродаж, 0) <> 0";
 	КонецЕсли;

	Если Продажи = 2 Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "ЕСТЬNULL(док.КоличествоПродаж, 0) = 0";
 	КонецЕсли;

	Если Не ПустаяСтрока(Отбор) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ";
		ТекстЗапроса = ТекстЗапроса + Отбор;
	КонецЕсли;
		
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	РодительНаименование,
	|	ПартнерНаименование,
	|	КонтрагентНаименование,
	|	ДоговорНаименование";

	Запрос.Текст = ТекстЗапроса;

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();

	Табл.Очистить();

	НомерСтроки = 0;

	Пока Выб.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;

		Стр = Табл.Добавить();

		ЗаполнитьЗначенияСвойств(Стр, Выб);

		Стр.НомерСтроки = НомерСтроки;
	КонецЦикла;

	ПоказатьПриложенияКДоговорам();
КонецПроцедуры

&НаСервере
Процедура ПоказатьПриложенияКДоговорам()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДоговоров", Табл.Выгрузить().ВыгрузитьКолонку("Договор"));
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	дог.Партнер КАК Партнер,
	|	дог.Контрагент КАК Контрагент,
	|	дог.Ссылка КАК Договор,
	|	рег.Номер КАК Номер,
	|	рег.Дата КАК Дата,
	|	рег.ВидПриложения КАК ВидПриложения,
	|	рег.ДатаПолученияСкана КАК ДатаПолученияСкана,
	|	рег.ДатаПолученияОригинала КАК ДатаПолученияОригинала,
	|	рег.Описание КАК Описание
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК дог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ПриложенияКДоговорам КАК рег
	|		ПО дог.Ссылка = рег.Договор
	|ГДЕ
	|	дог.Ссылка В (&МассивДоговоров)";
	
	Отбор = "";
	Если НетСканаПриложения Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "рег.ДатаПолученияСкана = ДАТАВРЕМЯ(1,1,1) И рег.ДатаПолученияОригинала = ДАТАВРЕМЯ(1,1,1)";
	КонецЕсли;
	
	Если НетОригиналаПриложения Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "И рег.ДатаПолученияОригинала = ДАТАВРЕМЯ(1,1,1)";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидПриложения) Тогда
		Отбор = Отбор + "
	|	" + ?(ПустаяСтрока(Отбор), "", "И ") + "И рег.ВидПриложения = &ВидПриложения";
 	КонецЕсли;

	Если Не ПустаяСтрока(Отбор) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ";
		ТекстЗапроса = ТекстЗапроса + Отбор;
	КонецЕсли;
		
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	дог.Партнер.Родитель.Наименование,
	|	дог.Партнер.Наименование,
	|	дог.Контрагент.Наименование,
	|	дог.Наименование,
	|	Номер";
	
	Запрос.Текст = ТекстЗапроса;
	
	Приложения.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПравоИзмененияДоговора()
	Возврат ПравоДоступа("Изменение", Метаданные.Справочники.ДоговорыКонтрагентов);
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьДоговор(Договор, Реквизит, Значение)
	ДоговорОбъект = Договор.ПолучитьОбъект();
	ДоговорОбъект[Реквизит] = Значение;
	ДоговорОбъект.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьДопДанныеДоговора(Договор, Реквизит, Значение)
	Запись = РегистрыСведений.AMS_ДанныеДоговоров.СоздатьМенеджерЗаписи();

	Запись.Договор = Договор;

	Запись.Прочитать();

	Запись.Договор = Договор;
	Запись[Реквизит] = Значение;

	Запись.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПриложенийЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьДоговор();

		Если СкрытьЗакрытыеДоговоры Тогда
			ПоказатьОтчет();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗакрытьДоговор()
	ДоговорОбъект = Договор.ПолучитьОбъект();
	ДоговорОбъект.Статус = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт");
	ДоговорОбъект.Записать();
КонецПроцедуры

#КонецОбласти
